<a href="https://colab.research.google.com/github/Souvik-karmakar/DivineAI_Python/blob/main/Lab_Class_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Scope or Lifetime of an object
def update(x):
    x=10
    print("inside function: "+str(x))
    
    
x=5
print("outside function:" +str(x))
update(x)
print("after executing the function, the value of x:" +str(x))

outside function:5
inside function: 10
after executing the function, the value of x:5

In [1]:
def func():
    y=10
    return y
    
func()
print(y)

NameError: ignored

**Qno-Define a function to add the elements present in a tuple. Tuple will be given as an argument.

# Zip

In [ ]:
#Zip function takes two list and combine it to list of tuples
l1=[1,2,3,4,5]
l2=[2,4,6,8,10]
print(zip(l1,l2)) #returns zip object

<zip object at 0x0000027B23A24600>

In [ ]:
print(list(zip(l1,l2))) #returns list of tuples

[(1, 2), (2, 4), (3, 6), (4, 8), (5, 10)]

**Qno-Using zip function make a list of tuples and then write a program to sort a list of tuples using Lambda.
Output1: [(56,12),(24,85),(63,89),(90,12)]
Output2: [(24, 85), (56, 12), (63, 89), (90, 12)]
Outpur3: [(56, 12), (90, 12), (24, 85), (63, 89)]

# Filter

In [ ]:
#filter(function,sequence )
filter(lambda x:x%2==0 , [1,2,3,4,5,6,7,8,9])

In [ ]:
list(filter(lambda x:x%2==0 , [1,2,3,4,5,6,7,8,9]))

[2, 4, 6, 8]

# Map

In [ ]:
#map(function,sequence)
map(lambda x:x*x , [1,2,3,4,5])

In [ ]:
list(map(lambda x:x*x , [1,2,3,4,5]))

[1, 4, 9, 16, 25]

# File handling

File handling is an important part of any web application.
Python has several functions for creating, reading, updating, and deleting files.

There are four different methods (modes) for opening a file:

"r" - Read - Default value. Opens a file for reading, error if the file does not exist

"a" - Append - Opens a file for appending, creates the file if it does not exist

"w" - Write - Opens a file for writing, creates the file if it does not exist

"x" - Create - Creates the specified file, returns an error if the file exists

In addition you can specify if the file should be handled as binary or text mode

"t" - Text - Default value. Text mode

"b" - Binary - Binary mode (e.g. images)

In [ ]:
#To open the file, use the built-in open() function.The open() function returns a file object
f = open("file1.txt",'x') #default 'r' is taken

In [ ]:
f = open("myfile.txt",'x')

FileExistsError: [Errno 17] File exists: 'myfile.txt'

In [ ]:
f = open("file1.txt",'r')

In [ ]:
#a read() method for reading the content of the file
print(f.read())

I'm learning Python programming
Python is easy to learn.

In [ ]:
f = open("file1.txt" , 'w')

In [ ]:
f.write("I'm learning Python programming \nPython is easy to learn.")

57

#Open a file on a different location:

f = open("D:\\myfiles\welcome.txt", "r")
print(f.read())

In [ ]:
#Read Only Parts of the File
#Return the 5 first characters of the file:

f = open("file1.txt", "r")
print(f.read(5))

I'm l

In [ ]:
#Read one line of the file:

f = open("file1.txt", "r")
print(f.readline())
print(f.readline())

I'm learning Python programming

Python is easy to learn.

In [ ]:
#Loop through the file line by line:

f = open("file1.txt", "r")
for x in f:
    print(x)

I'm learning Python programming

Python is easy to learn.

In [ ]:
#Close the file when you are finish with it:

f = open("file1.txt", "r")
print(f.readline())
f.close()

I'm learning Python programming

In [ ]:
#Write to an Existing File
"""
"a" - Append - will append to the end of the file

"w" - Write - will overwrite any existing content

"""
f = open("file2.txt", "a")
f.write("""Now the file has more content! \n Python is an interpreted high-level general-purpose programming language. 
        Python's design philosophy emphasizes code readability with its notable use of significant indentation. 
        Its language constructs as well as its object-oriented approach aim to help programmers write clear, logical code for 
        small and large-scale projects.""")

f.close()

#open and read the file after the appending:
f = open("file2.txt", "r")
print(f.read())

Now the file has more content!
 Python is an interpreted high-level general-purpose programming language.
        Python's design philosophy emphasizes code readability with its notable use of significant indentation.
        Its language constructs as well as its object-oriented approach aim to help programmers write clear, logical code for
        small and large-scale projects.Now the file has more content!
 Python is an interpreted high-level general-purpose programming language.
        Python's design philosophy emphasizes code readability with its notable use of significant indentation.
        Its language constructs as well as its object-oriented approach aim to help programmers write clear, logical code for
        small and large-scale projects.

In [ ]:
#Open the file "file3.txt" and overwrite the content:

f = open("file3.txt", "w")
f.write("Woops! I have deleted the content!")
f.close()

#open and read the file after the appending:
f = open("file3.txt", "r")
print(f.read())

Woops! I have deleted the content!

In [ ]:
f = open("file3.txt")
f.close()

In [ ]:
#Delete a File
#Remove the file "file1.txt":

import os
#os.remove("file1.txt")
os.remove("file3.txt")

In [ ]:
#Check if file exists, then delete it:

import os
if os.path.exists("file2.txt"):
    os.remove("file2.txt")
else:
    print("The file does not exist")

#Remove the folder "myfolder":

import os
os.rmdir("myfolder")

#Note: You can only remove empty folders.

# Exception handling

*The try block lets you test a block of code for errors.
*The except block lets you handle the error.
*The finally block lets you execute code, regardless of the result of the try- and except blocks.

In [ ]:
#When the try block raises an error, the except block will be executed.
try:
    a=10/0
except:
    print("Its impossible")

Its impossible

In [ ]:
try:
    print(h)
except:
    print("Something went wrong")
finally:
    print("The 'try except' is finished")

Something went wrong
The 'try except' is finished

In [ ]:
#Mentioning the type of error
try:
    a=9.5
    a.lower()
except AttributeError:
    print("A float value can't be converted in lowercase")

A float value can't be converted in lowercase

In [ ]:
try:
    a=9.9/0
except AttributeError:
    print("A float value can't be converted in lowercase")

ZeroDivisionError: float division by zero

In [ ]:
try:
    print(yu)
except NameError:
    print("Variable x is not defined")
except:
    print("Something else went wrong")

Variable x is not defined

In [ ]:
#Raising an error
a=input("Enter a no.:")
if a.isdigit():
    print("It is a no.")
else:
    raise ValueError

Enter a no.:h

ValueError:

In [ ]:
a=input("Enter a no.:")
if a.isdigit():
    print("It is a no.")
else:
    raise ZeroDivisionError

Enter a no.:h

ZeroDivisionError:

In [ ]:
#the try block does not generate any error:

try:
    print("Hello")
except:
    print("Something went wrong")
else:
    print("Nothing went wrong")

Hello
Nothing went wrong

**Qno-Open and write to a file that is not writable

# Loc() & iLoc()

In [ ]:
# importing pandas and numpy
import pandas as pd
import numpy as np

# crete a sample dataframe
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

# view the data
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [ ]:
data.loc[2:4,['age','city']]

   age    city
2   13  Mumbai
3   21   Delhi
4   12  Mumbai

In [ ]:
data.iloc[2:4,[0,2]]

   age    city
2   13  Mumbai
3   21   Delhi

In [ ]:
data.loc[data.age >= 15]

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
3   21       B   Delhi      M             NaN
6   17       A  Mumbai      F             red

In [ ]:
# select with multiple conditions
data.loc[(data.age >= 12) & (data.gender == 'M')]

   age section    city gender favourite_color
3   21       B   Delhi      M             NaN
4   12       B  Mumbai      M           black

In [ ]:
#slice
data.loc[1:3]

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
2   13       C  Mumbai      F          yellow
3   21       B   Delhi      M             NaN

In [ ]:
# select few columns with a condition
data.loc[(data.age >= 12), ['city', 'gender']]

     city gender
1   Delhi      F
2  Mumbai      F
3   Delhi      M
4  Mumbai      M
6  Mumbai      F

In [ ]:
# update a column with condition
data.loc[(data.age >= 12), ['section']] = 'M'
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       M    Delhi      F             NaN
2   13       M   Mumbai      F          yellow
3   21       M    Delhi      M             NaN
4   12       M   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       M   Mumbai      F             red

In [ ]:
# update multiple columns with condition
data.loc[(data.age >= 20), ['section', 'city']] = ['S','Pune']
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F             NaN
2   13       M   Mumbai      F          yellow
3   21       S     Pune      M             NaN
4   12       M   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       M   Mumbai      F             red

In [ ]:
# select rows with indexes
data.iloc[[0,2]]

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
2   13       M   Mumbai      F          yellow

In [ ]:
# select rows with particular indexes and particular columns
data.iloc[[0,2],[1,3]]

  section gender
0       A      M
2       M      F

In [ ]:
# select a range of rows
data.iloc[1:3]

   age section    city gender favourite_color
1   22       S    Pune      F             NaN
2   13       M  Mumbai      F          yellow

In [ ]:
# select a range of rows and columns
data.iloc[1:3,2:4]

     city gender
1    Pune      F
2  Mumbai      F

**Qno- By importing required module create a dataframe.Display the dataframe
{'Brand' : ['Maruti', 'Hyundai', 'Tata', 
                                'Mahindra', 'Maruti', 'Hyundai', 
                                'Renault', 'Tata', 'Maruti'], 
                     'Year' : [2012, 2014, 2011, 2015, 2012,  
                               2016, 2014, 2018, 2019], 
                     'Kms Driven' : [50000, 30000, 60000,  
                                     25000, 10000, 46000,  
                                     31000, 15000, 12000], 
                     'City' : ['Gurgaon', 'Delhi', 'Mumbai',  
                               'Delhi', 'Mumbai', 'Delhi',  
                               'Mumbai','Chennai',  'Ghaziabad'], 
                     'Mileage' :  [28, 27, 25, 26, 28,  
                                   29, 24, 21, 24]}
                                   
**After creating perform the following set of questions:-
1.selecting cars with brand 'Maruti' and Mileage > 25 
2.selecting range of rows from 2 to 5 
3.updating values of Mileage if Year < 2015 
4.selecting 0th, 2th, 4th, and 7th index rows 
5.selecting rows from 1 to 4 and columns from 2 to 4

**Qno- By importing required module create a dataframe.Display the dataframe {'Brand' : ['Maruti', 'Hyundai', 'Tata', 'Mahindra', 'Maruti', 'Hyundai', 'Renault', 'Tata', 'Maruti'], 'Year' : [2012, 2014, 2011, 2015, 2012,
2016, 2014, 2018, 2019], 'Kms Driven' : [50000, 30000, 60000,
25000, 10000, 46000,
31000, 15000, 12000], 'City' : ['Gurgaon', 'Delhi', 'Mumbai',
'Delhi', 'Mumbai', 'Delhi',
'Mumbai','Chennai', 'Ghaziabad'], 'Mileage' : [28, 27, 25, 26, 28,
29, 24, 21, 24]}

**After creating perform the following set of questions:-
1.selecting cars with brand 'Maruti' and Mileage > 25   #kushagra
2.selecting range of rows from 2 to 5   #Amartya
3.updating values of Mileage if Year < 2015 #Ashna
4.selecting 0th, 2th, 4th, and 7th index rows #saumya
5.selecting rows from 1 to 4 and columns from 2 to 4 #srijan

In [ ]:
import pandas as p
import numpy as n
 data= p.DataFrame({'Brand' : ['Maruti', 'Hyundai', 'Tata', 'Mahindra', 'Maruti', 'Hyundai', 'Renault', 'Tata', 'Maruti'],
                    'Year': [2012, 2014, 2011, 2015, 2012,
2016, 2014, 2018, 2019], 'Kms Driven' : [50000, 30000, 60000,25000, 10000, 46000,31000, 15000, 12000], 'City' : ['Gurgaon', 'Delhi', 'Mumbai','Delhi', 'Mumbai', 'Delhi',
'Mumbai','Chennai', 'Ghaziabad'], 'Mileage' : [28, 27, 25, 26, 28,29, 24, 21, 24]})

IndentationError: unexpected indent (<ipython-input-76-be56ccc47154>, line 3)

In [ ]:
#4.
display(data.iloc[[0,2,4,7]])

**Qno-By importing required module create a dataframe.Display the dataframe
{'age':[30, 2, 12, 4, 32, 33, 69],
                   'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'],
                   'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'],
                   'height':[165, 70, 120, 80, 180, 172, 150],
                   'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2],
                   'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX']
                   },
                  index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia']
**After creating perform the following set of questions:-
1.selecting column penelope
2.selecting columns cornelia,jane,dean
3.selecting columns from aaron upto dean 
4.selecting 4th index column
5.selecting rows from 1 to 4 and 2nd column

**Qno-By importing required module create a dataframe.Display the dataframe {'age':[30, 2, 12, 4, 32, 33, 69], 'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'], 'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'], 'height':[165, 70, 120, 80, 180, 172, 150], 'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2], 'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX'] }, index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'] 

**After creating perform the following set of questions:- 
1.selecting column penelope #abinash 
2.selecting columns cornelia,jane,dean #dikshya
3.selecting columns from aaron upto dean #dipam
4.selecting 4th index column #garima
5.selecting rows from 1 to 4 and 2nd column #mohit